2020-02-24-gestion-de-permisos-en-linux.html
<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="UTF-8" />
    <meta name="description" content="Permisos en linux" />
    <link
      rel="alternate"
      type="application/rss+xml"
      href="https://martiyo.github.io/rss.xml"
      title="RSS feed for https://martiyo.github.io/"
    />
    <title>Gestión de permisos en linux</title>
    <meta name="author" content="martiyo" />
    <meta name="referrer" content="no-referrer" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <link href="static/style.css" rel="stylesheet" type="text/css" />
    <link rel="icon" href="static/favicon.ico" />
  </head>
  <body>
    <div id="preamble" class="status">
      <div class="header">
        <ul>
          <li><a href="https://martiyo.github.io/">/home</a></li>
          <li><a href="https://martiyo.github.io/about">/about</a></li>
          <li><a href="https://martiyo.github.io/contact">/contact</a></li>
        </ul>
        <h1>El universo perdido de GNU/Emacs</h1>
        <blockquote>
          Este blog es una farsa son solo resumenes, traducciónes y cosas que
          encuentro por ahí.
        </blockquote>
        <form>
          <input type="text" placeholder="Search..." />
        </form>
        <br />
      </div>
    </div>
    <div id="content">
      <div class="post-date">24 feb 2020</div>
      <h1 class="post-title">
        <a
          href="https://martiyo.github.io/2020-02-24-gestion-de-permisos-en-linux.html"
          >Gestión de permisos en linux</a
        >
      </h1>
      <p>Permisos de acceso a archivos y directorios.</p>

      <div id="outline-container-org48e548b" class="outline-2">
        <h2 id="org48e548b">Permisos de acceso a archivos y directorios</h2>
        <div class="outline-text-2" id="text-org48e548b">
          <p>
            La mayoría de los sistemas de archivos modernos permiten asignar
            permisos (o derechos de acceso) a los archivos para determinados
            usuarios y grupos de usuarios. De esta manera, se puede restringir o
            permitir el acceso de un determinado usuario a un archivo para su
            visualización de contenidos, modificación y/o ejecución (en caso de
            un archivo ejecutable).
          </p>
        </div>
      </div>

      <div id="outline-container-orgb630592" class="outline-2">
        <h2 id="orgb630592">Chmod</h2>
        <div class="outline-text-2" id="text-orgb630592">
          <p>
            chmod ("change mode", cambiar modo en idioma inglés) es una llamada
            al sistema y su comando asociado en el sistema operativo UNIX
            (estandarizados en POSIX y otros estándares) que permite cambiar los
            permisos de acceso de un fichero o directorio.
          </p>
        </div>

        <div id="outline-container-orgf14b336" class="outline-3">
          <h3 id="orgf14b336">Ejemplos</h3>
          <div class="outline-text-3" id="text-orgf14b336">
            <div class="org-src-container">
              <pre class="src src-sh">
sudo chmod {a, u, g, o}{+, -}{r, w, x} archivo
</pre
              >
            </div>

            <ul class="org-ul">
              <li>a: todos los usuarios (all)</li>
              <li>o: otros usuarios</li>
              <li>u: propietario</li>
              <li>g: grupo propietario</li>
              <li>+: añade permiso</li>
              <li>-: quita permiso</li>
              <li>r: permiso de lectura</li>
              <li>w: permiso de escritura</li>
              <li>x: permiso de ejecución</li>
            </ul>

            <div class="org-src-container">
              <pre class="src src-sh">
sudo chmod u+rwx 
</pre
              >
            </div>

            <p>le da todos los permisos al propietario</p>

            <div class="org-src-container">
              <pre class="src src-sh">
sudo chmod ug+rwx 
</pre
              >
            </div>

            <p>le da todos los permisos al propietario y al grupo</p>
          </div>

          <div id="outline-container-orga121a30" class="outline-4">
            <h4 id="orga121a30">Clases de usuarios</h4>
            <div class="outline-text-4" id="text-orga121a30">
              <p>
                Los permisos de sistemas UNIX se dividen en cuatro clases,
                conocidas como usuario, grupo, otros y todos (con frecuencia
                abreviado UGOA por sus siglas en inglés).
              </p>

              <p>
                Por lo tanto, las clases de usuarios a los cuales se les puede
                asignar los permisos básicos anteriormente mencionados son:
              </p>

              <p>
                u &#x2013; usuario: dueño del fichero o directorio g &#x2013;
                grupo: grupo al que pertenece el fichero o &#x2013; otros: todos
                los demás usuarios que no son el dueño ni del grupo a &#x2013;
                todos: incluye al dueño, al grupo y a otros Los permisos
                efectivos aplicados a un determinado usuario en relación a un
                fichero se determinan en un orden lógico de precedencia. Por
                ejemplo, el usuario propietario del fichero tendrá los permisos
                efectivos dados a la clase de usuario, sin importar los
                asignados a la clase de grupo o a la clase de otros.
              </p>
            </div>
          </div>

          <div id="outline-container-org10dcc55" class="outline-4">
            <h4 id="org10dcc55">Modo octal</h4>
            <div class="outline-text-4" id="text-org10dcc55">
              <p>
                Las posibles combinaciones se resumen en números octales de tres
                dígitos del 000 al 777, cada uno de los cuales permite
                establecer un tipo de permiso distinto a cada clase de usuario
              </p>

              <p>Osea</p>

              <ul class="org-ul">
                <li>
                  0 = Ningún permiso (Lectura = 0 + Escritura = 0 + Ejecución =
                  0)
                </li>
                <li>
                  1 = Permiso de Ejecución (Lectura = 0 + Escritura = 0 +
                  Ejecución = 1)
                </li>
                <li>
                  2 = Permiso de Escritura (Lectura = 0 + Escritura = 2 +
                  Ejecución = 0)
                </li>
                <li>
                  3 = Permiso de Escritura y Ejecución (Lectura = 0, Escritura =
                  2, Ejecución = 1)
                </li>
                <li>
                  4 = Permiso de Lectura (Lectura = 4 + Escritura = 0 +
                  Ejecución = 0)
                </li>
                <li>
                  5 = Permiso de Lectura y Ejecución (Lectura = 4 + Escritura =
                  0 + Ejecución = 1)
                </li>
                <li>
                  6 = Permiso de Lectura y Escritura (Lectura = 4 + Escritura =
                  2 + Ejecución = 0)
                </li>
                <li>
                  7 = Permiso de Lectura, Escritura y Ejecución (Lectura = 4 +
                  Escritura = 2 + Ejecución = 1)
                </li>
              </ul>

              <p>Concretamente</p>

              <ul class="org-ul">
                <li>
                  644: propietario 6 (lectura-escritura), grupo 4 (solo
                  lectura), otros 4 (solo lectura)
                </li>
                <li>
                  751: propietario 7 (lectura-escritura-ejecución), grupo 5
                  (lectura y ejecución) y otro 1 (sólo ejecución)
                </li>
              </ul>
            </div>
          </div>
        </div>
      </div>
      <div class="taglist">
        <a href="https://martiyo.github.io/tags.html">Tags</a>:
        <a href="https://martiyo.github.io/tag-linux.html">linux</a>
      </div>
    </div>
    <div id="postamble" class="status">
      <div id="archive">
        <a href="https://martiyo.github.io/archive.html">Other posts</a>
      </div>
      <footer></footer>
    </div>
  </body>
</html>
